jrjohn/arcana-embedded-stm32/Targets/stm32f103ze/Services/Service/impl/AtsStorageServiceImpl.cpp
    // Proactive SDIO reinit — ensures stable reads during DB recovery
    sdio_force_reinit();
    LOG_I(ats::ErrorSource::Sdio, evt::SDIO_REINIT);
    log::Logger::getInstance().drain(8);

    // Open device.ats (permanent lifecycle DB) + restore RTC
    if (self->openDeviceDb()) {
        sDevApp.attach(&self->mDeviceDb);
        log::Logger::getInstance().addAppender(&sDevApp);
        self->restoreTimeFromDeviceDb();
        self->writeLifecycleEvent(
            static_cast<uint8_t>(ats::LifecycleEventType::PowerOn), 0);
    }
    log::Logger::getInstance().drain(8);

    printf("[ATS] Opening sensor DB...\r\n");
    if (!self->openDailyDb()) {
        LOG_F(ats::ErrorSource::Tsdb, evt::ATS_DB_OPEN_FAIL);
        log::Logger::getInstance().drain(8);
        // Publish zero stats so LCD shows "0" instead of blank
        self->mStatsModel.recordCount = 0;
        self->mStatsModel.writesPerSec = 0;
        self->mStatsModel.totalKB = 0;
        self->mStatsModel.kbPerSec = 0;
        self->mStatsModel.updateTimestamp();
        self->mStatsObs.publish(&self->mStatsModel);
        vTaskDelete(0);
        return;
    }

    // Write test: verify the DB is actually writable (catches corrupted files)
    {
        uint8_t testRec[RECORD_SIZE] = {};
        uint32_t ts = atsGetTime();
        memcpy(testRec, &ts, 4);
        self->mDb.append(0, testRec);
        uint32_t blkBefore = self->mDb.getStats().blocksWritten;
        self->mDb.flush();
        uint32_t blkAfter = self->mDb.getStats().blocksWritten;
        if (blkAfter <= blkBefore) {
            LOG_W(ats::ErrorSource::Tsdb, evt::ATS_WRITE_TEST_FAIL);
            sdio_force_reinit();
            self->mDb.append(0, testRec);
            blkBefore = self->mDb.getStats().blocksWritten;
            self->mDb.flush();
            blkAfter = self->mDb.getStats().blocksWritten;
        }
        if (blkAfter <= blkBefore) {
            // Write at EOF failed — corrupted cluster chain.
            // Compact: raw-copy valid blocks to a new file (clean clusters).
            // Uses mFilePort for reading (no extra FIL on stack).
            uint32_t validBlocks = self->mDb.getStats().blocksWritten;
            uint32_t validSize = (validBlocks + 1) * ats::BLOCK_SIZE;
            self->mDb.close();
            self->mDbReady = false;
            sdio_force_reinit();

            bool compacted = false;
            if (self->mFilePort.open("sensor.ats", ats::ATS_MODE_READ)) {
                static FIL sDst;  // static — too large for 4KB task stack
                if (f_open(&sDst, "sensor_new.ats",
                           FA_WRITE | FA_CREATE_ALWAYS) == FR_OK) {
                    uint32_t copied = 0;
                    bool ok = true;
                    while (copied < validSize && ok) {
                        int32_t rd = self->mFilePort.read(
                            sSlowBuf, ats::BLOCK_SIZE);
                        if (rd <= 0) { ok = false; break; }
                        UINT wr = 0;
                        if (f_write(&sDst, sSlowBuf, (UINT)rd, &wr)
                            != FR_OK || wr != (UINT)rd)
                            { ok = false; break; }
                        copied += wr;
                    }
                    f_close(&sDst);
                    self->mFilePort.close();
                    if (ok && copied >= validSize) {
                        f_unlink("sensor.ats");
                        f_rename("sensor_new.ats", "sensor.ats");
                        compacted = true;
                        LOG_W(ats::ErrorSource::Tsdb, evt::ATS_RECREATE,
                              validBlocks);
                    } else {
                        f_unlink("sensor_new.ats");
                    }
                } else {
                    self->mFilePort.close();
                }
            }

            if (!compacted) {
                LOG_E(ats::ErrorSource::Tsdb, evt::ATS_WRITE_TEST_FAIL);
                f_rename("sensor.ats", "sensor_bad.ats");
            }

            sdio_force_reinit();
            if (!self->openDailyDb()) {
                LOG_F(ats::ErrorSource::Tsdb, evt::ATS_DB_OPEN_FAIL);
                log::Logger::getInstance().drain(16);
                self->mStatsModel.recordCount = 0;
                self->mStatsModel.writesPerSec = 0;
                self->mStatsModel.totalKB = 0;
                self->mStatsModel.kbPerSec = 0;
                self->mStatsModel.updateTimestamp();
                self->mStatsObs.publish(&self->mStatsModel);
                vTaskDelete(0);
                return;
            }
        }
    }
    log::Logger::getInstance().drain(8);

    // Attach ATS appender now that sensor DB is confirmed writable
    sAtsApp.attach(&self->mDb, 1);
    log::Logger::getInstance().addAppender(&sAtsApp);

    // Log recovery event to both device.ats and sensor.ats
    {
        const ats::StorageStats& st = self->mDb.getStats();
        self->writeRecoveryEvents(
            st.totalRecords,
            (uint16_t)st.recoveryTruncations,
            (uint16_t)(st.blocksFailed - self->mBaselineBlocksFailed));
    }

    // Publish initial stats immediately so LCD shows recovered state
    // (don't wait 1 second for first taskLoop report)
    self->mStatsModel.recordCount = self->mTotalRecords;
    self->mStatsModel.writesPerSec = 0;
    self->mStatsModel.totalKB = (self->mDb.getStats().blocksWritten + 1) * 4;
    self->mStatsModel.kbPerSec = 0;
    self->mStatsModel.updateTimestamp();
    self->mStatsObs.publish(&self->mStatsModel);

    LOG_I(ats::ErrorSource::Tsdb, evt::ATS_READY, self->mTotalRecords);
    log::Logger::getInstance().drain(8);
    self->taskLoop();

    // --- Safe eject: close DBs + sync dual FAT + unmount ---
    printf("[SD] Shutting down...\r\n");
    if (self->mDbReady) {
        self->mDb.close();
        self->mDbReady = false;
    }
    if (self->mDeviceDbReady) {
        self->writeLifecycleEvent(
            static_cast<uint8_t>(ats::LifecycleEventType::PowerOff), 0);
        self->mDeviceDb.close();
        self->mDeviceDbReady = false;
    }
    log::Logger::getInstance().drain(8);
    syncDualFat();
    f_mount(0, "", 0);
    printf("[SD] Safe to remove card\r\n");
    lcdStatus("[SD] Safe to remove", 0x07E0);  // green

    vTaskDelete(0);
}

