jrjohn/arcana-embedded-stm32/Targets/stm32f103ze/Services/Service/impl/AtsStorageServiceImpl.cpp
bool AtsStorageServiceImpl::openDailyDb() {
    ats::AtsConfig cfg;
    memset(&cfg, 0, sizeof(cfg));

    cfg.file = &mFilePort;
    cfg.cipher = &mCipher;
    cfg.mutex = &mMutex;
    cfg.getTime = atsGetTime;
    cfg.key = sKey;
    cfg.deviceUid = (const uint8_t*)UID_BASE;
    cfg.deviceUidSize = 12;
    cfg.overflow = ats::OverflowPolicy::Drop;
    cfg.primaryChannel = 0xFF;  // no primary — all channels use slowBuf
    cfg.primaryBufA = 0;
    cfg.primaryBufB = 0;
    cfg.slowBuf = sSlowBuf;
    cfg.readCache = sReadCache;

    if (!mDb.open("sensor.ats", cfg)) {
        LOG_W(ats::ErrorSource::Tsdb, evt::ATS_DB_OPEN_FAIL);
        f_unlink("sensor.ats");
        if (!mDb.open("sensor.ats", cfg)) {
            LOG_E(ats::ErrorSource::Tsdb, evt::ATS_DB_OPEN_FAIL);
            return false;
        }
    }
    printf("[ATS] db.open OK (blk=%lu, rec=%lu, trunc=%lu)\r\n",
           (unsigned long)mDb.getStats().blocksWritten,
           (unsigned long)mDb.getStats().totalRecords,
           (unsigned long)mDb.getStats().recoveryTruncations);

    // If recovery loaded channels, skip addChannel/start
    if (!mDb.isReadOnly() && mDb.getChannelCount() == 0) {
        ats::ArcanaTsSchema sensor = ats::ArcanaTsSchema::mpu6050();
        if (!mDb.addChannel(0, sensor)) {
            LOG_E(ats::ErrorSource::Tsdb, evt::ATS_CHANNEL_FAIL, 0);
            mDb.close();
            return false;
        }

        ats::ArcanaTsSchema errLog = ats::ArcanaTsSchema::errorLog();
        if (!mDb.addChannel(1, errLog)) {
            LOG_E(ats::ErrorSource::Tsdb, evt::ATS_CHANNEL_FAIL, 1);
            mDb.close();
            return false;
        }

        if (!mDb.start()) {
            LOG_E(ats::ErrorSource::Tsdb, evt::ATS_START_FAIL);
            mDb.close();
            return false;
        }
    }

    mDbReady = true;
    mTotalRecords = mDb.getStats().totalRecords;
    mBaselineBlocksFailed = mDb.getStats().blocksFailed;
    LOG_I(ats::ErrorSource::Tsdb, evt::ATS_DB_OPEN_OK, mTotalRecords);
    return true;
}

void AtsStorageServiceImpl::rotateDailyDb(uint32_t lastDay) {
    LOG_I(ats::ErrorSource::Tsdb, evt::ATS_ROTATE_OK, lastDay);

    // Close current DB (flushes, writes index, syncs)
    mDb.close();
    mDbReady = false;

    // Rename sensor.ats to YYYYMMDD.ats
    char oldName[] = "sensor.ats";
    char newName[16];
    snprintf(newName, sizeof(newName), "%08lu.ats", (unsigned long)lastDay);
    f_rename(oldName, newName);

    // Open fresh DB
    if (!openDailyDb()) {
        LOG_E(ats::ErrorSource::Tsdb, evt::ATS_ROTATE_FAIL, lastDay);
    }
}

// ---------------------------------------------------------------------------
// device.ats — permanent lifecycle DB
// ---------------------------------------------------------------------------

bool AtsStorageServiceImpl::openDeviceDb() {
    ats::AtsConfig cfg;
    memset(&cfg, 0, sizeof(cfg));

    cfg.file = &mDeviceFilePort;
    cfg.cipher = &mCipher;
    cfg.mutex = &mMutex;  // shared with sensor DB (same task)
    cfg.getTime = atsGetTime;
    cfg.key = sKey;
    cfg.deviceUid = (const uint8_t*)UID_BASE;
    cfg.deviceUidSize = 12;
    cfg.overflow = ats::OverflowPolicy::Drop;
    cfg.primaryChannel = 0xFF;
    cfg.slowBuf = sDevSlowBuf;
    cfg.readCache = 0;  // device.ats writes rarely, can share slowBuf for reads

    f_unlink("device_bad.ats");  // clean up from previous crash

    if (!mDeviceDb.open("device.ats", cfg)) {
        LOG_W(ats::ErrorSource::Tsdb, evt::ATS_DB_OPEN_FAIL);
        f_rename("device.ats", "device_bad.ats");
        if (!mDeviceDb.open("device.ats", cfg)) {
            LOG_E(ats::ErrorSource::Tsdb, evt::ATS_DB_OPEN_FAIL);
            return false;
        }
    }

    printf("[DEV] db.open OK (blk=%lu, rec=%lu, trunc=%lu)\r\n",
           (unsigned long)mDeviceDb.getStats().blocksWritten,
           (unsigned long)mDeviceDb.getStats().totalRecords,
           (unsigned long)mDeviceDb.getStats().recoveryTruncations);

    if (mDeviceDb.getChannelCount() == 0) {
        ats::ArcanaTsSchema lc = ats::ArcanaTsSchema::lifecycleEvent();
        if (!mDeviceDb.addChannel(0, lc)) {
            LOG_E(ats::ErrorSource::Tsdb, evt::ATS_CHANNEL_FAIL);
            mDeviceDb.close();
            return false;
        }
        if (!mDeviceDb.start()) {
            LOG_E(ats::ErrorSource::Tsdb, evt::ATS_START_FAIL);
            mDeviceDb.close();
            return false;
        }
    }

    // Write test — verify device.ats is writable
    {
        uint8_t testRec[12] = {};
        uint32_t ts = atsGetTime();
        memcpy(testRec, &ts, 4);
        testRec[4] = 0xFF;  // test event type
        mDeviceDb.append(0, testRec);
        uint32_t blkBefore = mDeviceDb.getStats().blocksWritten;
        mDeviceDb.flush();
        uint32_t blkAfter = mDeviceDb.getStats().blocksWritten;
        if (blkAfter <= blkBefore) {
            LOG_W(ats::ErrorSource::Sdio, evt::SDIO_REINIT);
            sdio_force_reinit();
            mDeviceDb.append(0, testRec);
            mDeviceDb.flush();
        }
    }

    mDeviceDbReady = true;
    LOG_I(ats::ErrorSource::Tsdb, evt::ATS_DB_OPEN_OK,
          mDeviceDb.getStats().totalRecords);
    return true;
}

void AtsStorageServiceImpl::restoreTimeFromDeviceDb() {
    if (!mDeviceDbReady) return;
    if (SystemClock::getInstance().isSynced()) return;  // RTC already valid

    // Read latest lifecycle record to get last known timestamp
    // LIFECYCLE record: [ts:4][eventType:1][eventCode:2][reserved:1][param:4] = 12 bytes
    uint8_t buf[12];
    uint16_t n = mDeviceDb.queryLatest(0, buf, 1);
    if (n > 0) {
        uint32_t lastEpoch;
        memcpy(&lastEpoch, buf, 4);
        if (lastEpoch > 1577836800) {  // > 2020-01-01
            SystemClock::getInstance().sync(lastEpoch);
            LOG_I(ats::ErrorSource::System, evt::SYS_BOOT_RTC_RESTORE, lastEpoch);
        }
    }
}

void AtsStorageServiceImpl::writeLifecycleEvent(uint8_t eventType, uint32_t param) {
    if (!mDeviceDbReady) return;

